python_pandas.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-29 Sun 17:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - Pandas</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - Pandas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org005ee42">数据结构</a>
<ul>
<li><a href="#org6b72c2c">Series</a></li>
<li><a href="#org7514a0b">DataFrame</a></li>
<li><a href="#orgbdb1dee">索引对象</a></li>
</ul>
</li>
<li><a href="#orgd8ff941">基本功能</a>
<ul>
<li><a href="#orgb32d48e">计算统计</a>
<ul>
<li><a href="#org62da982">可选参数</a></li>
<li><a href="#org18e0e03">汇总</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org74ee81b">输入输出</a></li>
</ul>
</div>
</div>
<p>
<code>Pandas</code> 支持大部分 <code>numpy</code> 语言风格的数组计算。尽管代码风格相似，但最大的不同在于前者是用来处理表格或不同类型数据的，而后者更适合处理相同类型数据的。
</p>

<div id="outline-container-org005ee42" class="outline-2">
<h2 id="org005ee42">数据结构</h2>
<div class="outline-text-2" id="text-org005ee42">
</div>
<div id="outline-container-org6b72c2c" class="outline-3">
<h3 id="org6b72c2c">Series</h3>
<div class="outline-text-3" id="text-org6b72c2c">
<ul class="org-ul">
<li><code>Series</code> 是一维数组的对象，包含 <code>index</code> 序列和 <code>values</code> 序列，分别可以通过对象的 <code>index</code> 和 <code>values</code> 属性获得。</li>
<li>通常需要创建一个index序列来标识每个数据点。如果不显式指定，那么默认 <code>index</code> 为从0到N-1，其中N为Series对象的长度。</li>
<li><code>index</code> 可以用来索引数据，在这种意义上， <code>Series</code> 就像一个有序的字典。 另外，可以通过字典直接生成 <code>Series</code> 对象。</li>
<li><code>pandas</code> 用 <code>NaN (not a number)</code> 来标记缺失或NA值，用 <code>isnull</code> 和 <code>notnull</code> 函数来检查 <code>Series</code> 对象。同时， <code>isnull</code> 和 <code>notnull</code> 也是 <code>Series</code> 类的成员函数。</li>
</ul>
</div>
</div>
<div id="outline-container-org7514a0b" class="outline-3">
<h3 id="org7514a0b">DataFrame</h3>
<div class="outline-text-3" id="text-org7514a0b">
<ul class="org-ul">
<li><code>DataFrame</code> 是二维数据表，既有行索引，又有列索引。可以通过属性 <code>T</code> 进行转置。每一列可以是不同的类型（数值、字符串、布尔值等）。</li>
<li>和 <code>Series</code> 类似， <code>DataFrame</code> 的 <code>values</code> 属性会将数据以二维ndarray形式返回。</li>
<li>虽然 <code>DataFrame</code> 是二维的，但是可以通过分层索引扩展到更高维度的数据。</li>
<li>在将列表或数组赋值给某一列时，列表或数组的长度必须和 <code>DataFrame</code> 对象的长度相等。将 <code>Series</code> 对象赋值给某一列时， 其索引会按照 <code>DataFrame</code> 对象的索引重新排序，并用缺失值填充空缺位置。</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdb1dee" class="outline-3">
<h3 id="orgbdb1dee">索引对象</h3>
<div class="outline-text-3" id="text-orgbdb1dee">
<ul class="org-ul">
<li><code>Pandas</code> 中的索引对象是用于存储轴标签和其他元数据的。构建 <code>Series</code> 或 <code>DataFrame</code> 对象时所使用的数组或标签序列都可以在内部转换为索引对象。</li>
<li>索引对象是不可变的，不能修改。</li>
<li>索引对象的 <code>is_unique</code> 属性可以返回其标签是否唯一。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd8ff941" class="outline-2">
<h2 id="orgd8ff941">基本功能</h2>
<div class="outline-text-2" id="text-orgd8ff941">
<ul class="org-ul">
<li>成员函数 <code>reindex</code> : 重建索引。支持如下参数：
<ul class="org-ul">
<li><code>index</code> : 作为新索引的序列。</li>
<li><code>level</code> : 匹配 <code>MultiIndex</code> 级别的简单索引。</li>
</ul></li>
<li>成员函数 <code>drop</code> : 删除行或列，参数为行或列索引列表。在删除列时，需要增加参数axis=1或axis='columns'。</li>
<li>成员函数 <code>head()</code> 返回前五行。</li>
<li>成员函数 <code>set_index</code> (参数可以为单个列名或多个列名的列表) 将选中的列转换为索引。</li>
<li>成员函数 <code>filter(regex=KEYWORD)</code> 可以通过正则表达式对列名进行过滤筛选，返回一个符合筛选条件的新 <code>DataFrame</code> 。</li>
<li>成员函数 <code>apply</code> 可以将函数应用到一列或一行的一维数组上。特别地，如果应用到行，除了函数作为参数外，还需要增加参数axis='columns'。另外，传递给apply的函数并不一定要返回一个标量值，也可以返回带有多个值的Series。</li>
<li>成员函数 <code>applymap</code> 可以将函数应用到每一个元素上。</li>
<li><p>
成员函数 <code>plot</code> 可以直接调用 <code>matplotlib</code> 绘图。默认地，以索引作为x轴，各个数据列为y轴，列名作为图例名称。但是其行为可以定制。例如，
</p>
<div class="org-src-container">
<pre class="src src-python">df.plot(ax=AX, x=COL1_NAME, y=COL2_NAME, title=TITLE, xlabel=XLABEL, ylabel=YLABEL, grid=True/False, legend=True/False, linestyle=LINESTYLE, xlim=[XMIN, XMAX], ylim=[YMIN, YMAX])
</pre>
</div></li>
<li>成员函数 <code>sort_index</code> 可以按照行索引或列索引进行字典型排序，该方法返回一个新的排序好的 <code>DataFrame</code> 对象。
<ul class="org-ul">
<li>默认为按行排序。可以通过参数 <code>axis=1</code> 来按列排序。</li>
<li>默认为升序排序，可以通过参数 <code>ascending=False</code> 来降序排列。</li>
</ul></li>
<li>成员函数 <code>sort_values</code> 可以根据值来对 <code>Series</code> 对象或者 <code>DataFrame</code> 对象排序。
<ul class="org-ul">
<li>对于 <code>DataFrame</code> 对象，可以通过将列名或列名列表作为参数传给可选参数 <code>by</code> 来根据一列或者多列的值排序。</li>
</ul></li>
<li><code>DataFrame</code> 对象可以通过行索引返回 <code>Series</code> 对象，如 <code>DataFrame.loc['index_name']</code> 或 <code>DataFrame.iloc['index']</code> 。</li>
<li><code>DataFrame</code> 对象可以通过列索引返回 <code>Series</code> 对象，如 <code>DataFrame.loc[:, 'index_name']</code> 或 <code>DataFrame.iloc[:, 'index']</code> 或 <code>DataFrame['column_name']</code> ，如果列名无效，那么会新建列。此外， <code>DataFrame.column_name</code> 也能达到相同目的，但仅当列名存在时才有效时。值得注意的是，索引的列是数据的视图，而不是拷贝。因此，对返回 <code>Series</code> 对象的修改会映射到 <code>DataFrame</code> 对象。如果需要复制，需要调用 <code>Series</code> 类的 <code>copy</code> 成员函数。</li>
<li><code>DataFrame</code> 对象可以通过行列索引来返回单个标量值，如 <code>DataFrame.at['row_index_name', 'column_index_name']</code> 或 <code>DataFrame.iat['row_index, 'column_index']</code> 。</li>
<li><p>
<code>concat</code> : 合并多个Series或DataFrame。例如，
</p>
<div class="org-src-container">
<pre class="src src-python">import pandas as pd

df = pd.concat([df1, df2], axis=1)
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-orgb32d48e" class="outline-3">
<h3 id="orgb32d48e">计算统计</h3>
<div class="outline-text-3" id="text-orgb32d48e">
</div>
<div id="outline-container-org62da982" class="outline-4">
<h4 id="org62da982">可选参数</h4>
<div class="outline-text-4" id="text-org62da982">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">参数</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>axis</code></td>
<td class="org-left">归约轴，0为行，1为列。</td>
</tr>

<tr>
<td class="org-left"><code>skipna</code></td>
<td class="org-left">是否跳过NaN ，默认值为 <code>True</code> 。</td>
</tr>

<tr>
<td class="org-left"><code>level</code></td>
<td class="org-left">如果是多层索引（MultiIndex），该参数可以降低索引层数。</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org18e0e03" class="outline-4">
<h4 id="org18e0e03">汇总</h4>
<div class="outline-text-4" id="text-org18e0e03">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>count</code></td>
<td class="org-left">非NaN值的个数</td>
</tr>

<tr>
<td class="org-left"><code>describe</code></td>
<td class="org-left">Series对象或DataFrame对象各列的统计汇总。</td>
</tr>

<tr>
<td class="org-left"><code>min/max</code></td>
<td class="org-left">最小/大值</td>
</tr>

<tr>
<td class="org-left"><code>argmin/argmax</code></td>
<td class="org-left">最小/大值的索引</td>
</tr>

<tr>
<td class="org-left"><code>idxmin/idxmax</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>quantile</code></td>
<td class="org-left">计算0到1之间的分位数。</td>
</tr>

<tr>
<td class="org-left"><code>sum</code></td>
<td class="org-left">和</td>
</tr>

<tr>
<td class="org-left"><code>mean</code></td>
<td class="org-left">均值</td>
</tr>

<tr>
<td class="org-left"><code>prod</code></td>
<td class="org-left">积</td>
</tr>

<tr>
<td class="org-left"><code>median</code></td>
<td class="org-left">中位数（0.5分位数）</td>
</tr>

<tr>
<td class="org-left"><code>mad</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>var</code></td>
<td class="org-left">方差</td>
</tr>

<tr>
<td class="org-left"><code>std</code></td>
<td class="org-left">标准差</td>
</tr>

<tr>
<td class="org-left"><code>skew</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>kurt</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>cumsum</code></td>
<td class="org-left">累加值</td>
</tr>

<tr>
<td class="org-left"><code>cummin/cummax</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>cumprod</code></td>
<td class="org-left">累积值</td>
</tr>

<tr>
<td class="org-left"><code>diff</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>pct_change</code></td>
<td class="org-left">百分比</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-org74ee81b" class="outline-2">
<h2 id="org74ee81b">输入输出</h2>
<div class="outline-text-2" id="text-org74ee81b">
<ul class="org-ul">
<li><p>
<code>read_csv</code>
</p>
<div class="org-src-container">
<pre class="src src-python">import pandas as pd

df = pd.read_csv(FILENAME, [skiprows=N], [names=[COL1, COL2, COL3, ...]], [index_col=[0, 1]])
</pre>
</div></li>
<li><code>to_csv</code></li>
</ul>
</div>
</div>
</div>
</body>
</html>